# Завдання 1
# Напишіть программу "Касир в кінотеватрі", яка буде виконувати наступне:
# Попросіть користувача ввести свсвій вік (можно використати константу або input()).

# - якщо користувачу менше 7 - вивести "Де твої батьки?"
# - якщо користувачу менше 16 - вивести "Це фільм для дорослих!"
# - якщо користувачу більше 65 - вивести "Покажіть пенсійне посвідчення!"
# - якщо вік користувача складається з однакових цифр (11, 22, 44 і тд років, всі можливі варіанти!):
#   вивести "Який цікавий вік!"
# - у будь-якому іншому випадку - вивести "А білетів вже немає!"

import sys
age = input("Enter your age! ")
if not age.isdigit():
    print("Data error!")
    sys.exit()
# palindrome check
if len(age) >= 2:
    if age == age[::-1]:
        print("Який цікавий вік!")
        sys.exit()

age = int(age)
if age < 7:
    print("Де твої батьки?")
elif 7 < age < 16:
    print("Це фільм для дорослих!")
elif age > 65:
    print("Покажіть пенсійне посвідчення!")
else:
    print("А білетів вже немає!")
